tyh21/da14585_420/da14585_420_SES_3init/sdk/platform/arch/main/jump_table.c
/**
 ****************************************************************************************
 *
 * @file jump_table.c
 *
 * @brief Jump table that holds function pointers and variables used in ROM code.
 *
 * Copyright (C) 2016-2021 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 ****************************************************************************************
 */

#include <string.h>          // for mem* functions
#include <stdint.h>
#include "rwip_config.h"     // RW SW configuration
#include "co_version.h"
#include "rwip.h"            // RW definitions
#include "arch.h"            // Platform architecture definition
#include "em_map_ble.h"
#include "em_map.h"
#include "da1458x_scatter_config.h" // for BLE_CONNECTION_MAX_USER

#if (BLE_EMB_PRESENT)
#include "rwble.h"           // rwble definitions
#endif //BLE_EMB_PRESENT

#if (BLE_HOST_PRESENT)
#include "rwble_hl.h"        // BLE HL definitions
#include "gapc.h"
#include "smpc.h"
#include "gattc.h"
#include "attc.h"
#include "atts.h"
#include "l2cc.h"
#endif //BLE_HOST_PRESENT

#include "lld_sleep.h"       // definitions for sleep mode
#include "llc.h"
#include "plf.h"             // platform definition
#include "rf.h"              // RF definitions

#if (GTL_ITF)
#include "gtl.h"
#endif //GTL_ITF

#include "ke.h"              // kernel definition
#include "ke_event.h"        // kernel event
#include "ke_timer.h"        // definitions for timer
#include "ke_mem.h"          // kernel memory manager
#include "dbg.h"             // debug definition
#include "uart.h"


#if ((BLE_APP_PRESENT) || ((BLE_HOST_PRESENT && (!GTL_ITF))))
#include "app.h"
#endif //BLE_APP_PRESENT

#include "nvds.h"

#if (USE_CHACHA20_RAND)
#include "chacha20.h"
#endif

/*
 * forward declarations
 ******************************/

extern void rf_init_func(struct rwip_rf_api *api);
extern void rf_reinit_func(void);
extern void uart_init_func(uint16_t baudr,uint8_t dlf_value, uint8_t mode );
extern bool uart_flow_off_func(void);
extern void uart_flow_on_func(void);
extern void uart_finish_transfers_func(void);
extern void uart_read_func(uint8_t *bufptr, uint32_t size, void (*callback) (uint8_t));
extern void uart_write_func(uint8_t *bufptr, uint32_t size, void (*callback) (uint8_t));
#ifdef CFG_UART1_SDK
extern void UART_Handler_SDK_func(void);
#else
extern void UART_Handler_func(void);
#endif

extern void gtl_init_func(const struct rwip_eif_api* eif);
extern void gtl_eif_init_func(void);
extern void gtl_eif_read_start_func(void);
extern void gtl_eif_read_hdr_func(uint8_t len);
extern void gtl_eif_read_payl_func(uint16_t len, uint8_t* p_buf);
extern void gtl_eif_tx_done_func(uint8_t status);
extern void gtl_eif_rx_done_func(uint8_t status);
extern void h4tl_init_func(const struct rwip_eif_api* eif);
extern void h4tl_read_start_func(void);
extern void h4tl_read_hdr_func(uint8_t len);
extern void h4tl_read_payl_func(uint16_t len);
extern void h4tl_read_next_out_of_sync_func(void);
extern void h4tl_out_of_sync_func(void);
extern void h4tl_tx_done_func(uint8_t status);
extern void h4tl_rx_done_func(uint8_t status);
extern void ke_task_init_func(void);
extern void ke_timer_init_func(void);
extern void llm_encryption_done_func(void);
extern uint8_t nvds_get_func(uint8_t tag, nvds_tag_len_t * lengthPtr, uint8_t *buf);
extern uint8_t nvds_put_func(uint8_t tag, nvds_tag_len_t length, uint8_t *buf);
extern uint8_t nvds_del_func(uint8_t tag);
extern uint8_t nvds_init_func(uint8_t *base, uint32_t len);
extern const struct rwip_eif_api* rwip_eif_get_func(uint8_t type);

extern void platform_reset_func(uint32_t error);
extern void lld_sleep_compensate_func(void);
extern void lld_sleep_init_func(void);

extern void lld_test_stop_func(struct ea_elt_tag *elt);
extern struct ea_elt_tag *lld_test_mode_tx_func(struct co_buf_tx_node *txdesc, uint8_t tx_freq);

#if defined (__DA14531__) && !defined (__DA14531_01__)
extern struct ea_elt_tag *JT_lld_test_mode_rx_func(uint8_t rx_freq); // Rx window size set to 10ms in DA14531
#else
extern struct ea_elt_tag *lld_test_mode_rx_func(uint8_t rx_freq);
#endif

extern uint8_t smpc_check_param_func(struct l2cc_pdu *pdu);
extern void smpc_pdu_recv_func(uint8_t conidx, struct l2cc_pdu *pdu);

extern void prf_init_func(bool reset);
struct gapm_profile_task_add_cmd;
extern uint8_t prf_add_profile_func(struct gapm_profile_task_add_cmd * params, ke_task_id_t* prf_task);
extern void prf_create_func(uint8_t conidx);
extern void prf_cleanup_func(uint8_t conidx, uint8_t reason);
extern ke_task_id_t prf_get_id_from_task_func(ke_msg_id_t task);
extern ke_task_id_t prf_get_task_from_id_func(ke_msg_id_t id);

#if defined (CFG_DBG_TASK)
extern void dbg_init_func(void);
extern void dbg_platform_reset_complete_func(uint32_t error);
#endif

extern int hci_rd_local_supp_feats_cmd_handler_func(ke_msg_id_t const msgid, void const *param,
                                                    ke_task_id_t const dest_id, ke_task_id_t const src_id);

extern uint8_t l2cc_pdu_pack_func(struct l2cc_pdu *p_pdu, uint16_t *p_offset, uint16_t *p_length, uint8_t *p_buffer,
                                  uint8_t conidx, uint8_t *llid);

#ifndef __DA14531_01__
extern uint8_t JT_l2cc_pdu_unpack_func(struct l2cc_pdu *p_pdu, uint16_t *p_offset, uint16_t *p_rem_len,
                                    const uint8_t *p_buffer, uint16_t pkt_length, uint8_t conidx, uint8_t llid);
#else
extern uint8_t l2cc_pdu_unpack_func(struct l2cc_pdu *p_pdu, uint16_t *p_offset, uint16_t *p_rem_len,
                                    const uint8_t *p_buffer, uint16_t pkt_length, uint8_t conidx, uint8_t llid);
#endif

extern void l2c_send_lecb_message_func(uint8_t conidx, uint16_t cid, uint16_t size);
extern uint16_t l2c_process_sdu_func(uint8_t conidx, struct l2cc_pdu *pdu);


#ifndef __DA14531_01__
extern int JT_l2cc_pdu_recv_ind_handler_func(ke_msg_id_t const msgid, struct l2cc_pdu_recv_ind *ind,
                                          ke_task_id_t const dest_id, ke_task_id_t const src_id);
#else
extern int l2cc_pdu_recv_ind_handler_func(ke_msg_id_t const msgid, struct l2cc_pdu_recv_ind *ind,
                                          ke_task_id_t const dest_id, ke_task_id_t const src_id);
#endif

extern int gapc_lecb_connect_cfm_handler_func(ke_msg_id_t const msgid,
                                              struct gapc_lecb_connect_cfm *param,
                                              ke_task_id_t const dest_id, ke_task_id_t const src_id);
extern int atts_l2cc_pdu_recv_handler_func(uint8_t conidx, struct l2cc_pdu_recv_ind *param);
extern int attc_l2cc_pdu_recv_handler_func(uint8_t conidx, struct l2cc_pdu_recv_ind *param);

extern void crypto_init_func(void);
extern void dummyf(void);

#ifndef __DA14531_01__
extern void llm_le_adv_report_ind_func(struct co_buf_rx_desc *rxdesc);
#endif

extern int PK_PointMult_func(const ec_point *A, const uint8_t k[ECDH_KEY_LEN], ec_point *dst);

#if defined (CFG_HCI) && !defined (__DA14531__)
extern void JT_llm_p256_start_func(struct ke_msg * msg);
#else
extern void llm_p256_start_func(struct ke_msg * msg);
#endif

