tyh21/da14585_420/da14585_420_SES_3init/sdk/platform/arch/main/jump_table.c
extern uint8_t llm_create_p256_key_func(uint8_t state, uint8_t *A, uint8_t *priv);
extern int llm_p256_req_handler_func(ke_msg_id_t const msgid,
                                     struct llm_p256_req const *param,
                                     ke_task_id_t const dest_id,
                                     ke_task_id_t const src_id);

#ifndef __DA14531__
extern bool JT_llc_le_length_effective_func(uint16_t conhdl);
#else
extern bool llc_le_length_effective_func(uint16_t conhdl);
#endif

extern void llc_le_length_conn_init_func(uint16_t conhdl);
extern void lld_data_tx_prog_func(struct lld_evt_tag *evt);
struct lld_evt_tag;
struct lld_data_ind;
extern void lld_data_tx_check_func(struct lld_evt_tag *evt, struct lld_data_ind *msg);
extern void llc_pdu_send_func(uint16_t conhdl, uint8_t length);

extern int dia_rand_func(void);
extern void dia_srand_func (unsigned int seed);
extern uint8_t ba431_get_rand_func(uint32_t id, uint8_t * dest, uint32_t byte_size);

#if !defined (__DA14531__)      // Only for DA14585, DA14586
extern bool modulationGainCalibration_func(int16_t average, int16_t length, int16_t modindex);
extern void DCoffsetCalibration_func(void);
extern void PllLF_IFF_MIX_CapCalibration_func(void);
#endif

extern void smpc_public_key_exchange_start_func(uint8_t idx);
extern void smpc_dhkey_calc_ind_func(uint8_t conidx);
extern void smpm_ecdh_key_create_func(struct ecdh_key_pair *keys);

#if defined (__DA14531__)
extern void ble_init_arp_func(uint32_t base_addr);
#endif
/*
 * Heaps
 ****************************************************************************************
 */

#if (BLE_CONNECTION_MAX_USER == 1)
#define RWIP_HEAP_NON_RET_SIZE_USER     1024
#else
#define RWIP_HEAP_NON_RET_SIZE_USER     2048 //(1024 * BLE_CONNECTION_MAX_USER)
#endif

#define RWIP_HEAP_ENV_SIZE_USER         ((BLE_HEAP_ENV_SIZE+  BLEHL_HEAP_ENV_SIZE)  * BLE_CONNECTION_MAX_USER)

#define BLE_HEAP_MSG_SIZE_USER          (256 * (BLE_CONNECTION_MAX_USER+1) + 80 * (BLE_CONNECTION_MAX_USER) + 96 * (2*BLE_CONNECTION_MAX_USER+1))
#define BLEHL_HEAP_MSG_SIZE_USER        (256 + 256 * BLE_CONNECTION_MAX_USER)
#define RWIP_HEAP_MSG_SIZE_USER         ( BLE_HEAP_MSG_SIZE_USER  +  BLEHL_HEAP_MSG_SIZE_USER )


// Heap header size is 12 bytes
#define RWIP_HEAP_HEADER                (12 / sizeof(uint32_t)) //header size in uint32_t
// ceil(len/sizeof(uint32_t)) + RWIP_HEAP_HEADER
#define RWIP_CALC_HEAP_LEN(len)         ((((len) + (sizeof(uint32_t) - 1)) / sizeof(uint32_t)) + RWIP_HEAP_HEADER)

#define HEAP_HDR_LEN  (12) // in bytes

/// Not retained heap
#ifndef NON_RET_HEAP_SZ
    #define RWIP_HEAP_NON_RET_SIZE_JT       RWIP_HEAP_NON_RET_SIZE_USER // in bytes
#else
    #define RWIP_HEAP_NON_RET_SIZE_JT       NON_RET_HEAP_SZ             // in bytes
#endif

/// Env Heap
#ifndef ENV_HEAP_SZ
    #define RWIP_HEAP_ENV_SIZE_JT           RWIP_HEAP_ENV_SIZE_USER     // in bytes
#else
    #define RWIP_HEAP_ENV_SIZE_JT           ENV_HEAP_SZ                 // in bytes
#endif

/// DB Heap
#ifndef DB_HEAP_SZ
    #define RWIP_HEAP_DB_SIZE_JT            1024                        // in bytes
#else
    #define RWIP_HEAP_DB_SIZE_JT            DB_HEAP_SZ                  // in bytes
#endif

/// Msg Heap
#ifndef MSG_HEAP_SZ
    #define RWIP_HEAP_MSG_SIZE_JT           RWIP_HEAP_MSG_SIZE_USER     // in bytes
#else
    #define RWIP_HEAP_MSG_SIZE_JT           MSG_HEAP_SZ                 // in bytes
#endif

uint32_t rwip_heap_non_ret[RWIP_CALC_HEAP_LEN(RWIP_HEAP_NON_RET_SIZE_JT)]   __SECTION_ZERO("heap_mem_area_not_ret");
uint32_t rwip_heap_env_ret[RWIP_CALC_HEAP_LEN(RWIP_HEAP_ENV_SIZE_JT)]       __SECTION_ZERO("heap_env_area");
uint32_t rwip_heap_msg_ret[RWIP_CALC_HEAP_LEN(RWIP_HEAP_MSG_SIZE_JT)]       __SECTION_ZERO("heap_msg_area");
uint32_t rwip_heap_db_ret[RWIP_CALC_HEAP_LEN(RWIP_HEAP_DB_SIZE_JT)]         __SECTION_ZERO("heap_db_area");


/*
 * ROM function table function definitions
 ****************************************************************************************
 */
void dummyf()
{
}

void crypto_init_func(void)
{
}

uint8_t ba431_get_rand_func(uint32_t id, uint8_t * dest, uint32_t byte_size)
{
    uint8_t i;
    for (i = 0; i < 32; i++)
        dest[i] = co_rand_byte();

   return 0;
}

int dia_rand_func(void)
{
#if (USE_CHACHA20_RAND)
    return csprng_get_next_uint32();
#else
    return rand();
#endif
}

void dia_srand_func(unsigned int seed)
{
#if (USE_CHACHA20_RAND)
    uint8_t temp[16];
    temp[0] = (seed >> 24) & 0xFF;
    temp[1] = (seed >> 16) & 0xFF;
    temp[2] = (seed >> 8) & 0xFF;
    temp[3] = seed & 0xFF;
    csprng_seed(temp);
#else
    srand(seed);
#endif
}

void dbg_init_func_empty(void);
void dbg_init_func_empty(void)
{
}

void dbg_platform_reset_complete_func_empty(uint32_t error);
void dbg_platform_reset_complete_func_empty(uint32_t error)
{
}

#if !defined (__DA14531_01__)
#if (!ENABLE_SMP_SECURE)
void smpm_ecdh_key_create_empty_func(void)
{
}
#endif // ENABLE_SMP_SECURE
#endif // __DA14531_01__

void platform_reset_func(uint32_t error)
{
    uint16_t tmp;

#if (!PRODUCTION_TEST)
    // Trigger assert if the reset reason is other than RESET_AFTER_SUOTA_UPDATE
    ASSERT_WARNING(error == RESET_AFTER_SUOTA_UPDATE);
#endif
    // Trigger SW reset
    tmp = GetWord16(SYS_CTRL_REG);
    tmp = (tmp & ~REMAP_ADR0) | 0; // Map ROM at address 0
    tmp |= SW_RESET;
    SetWord16(SYS_CTRL_REG, tmp);
}


#if defined(CFG_UART_ONE_WIRE_SUPPORT)

void one_wire_uart_write_func(uint8_t *bufptr, uint32_t size, void (*callback) (uint8_t))
{
    uart_one_wire_tx_en(UART1);
    uart_write_func(bufptr, size,callback);
}

void one_wire_uart_h4tl_tx_done_func(uint8_t status)
{
    h4tl_tx_done_func(status);
    uart_one_wire_rx_en(UART1);
}

void one_wire_uart_gtl_eif_tx_done_func(uint8_t status)
{
    gtl_eif_tx_done_func(status);
    uart_one_wire_rx_en(UART1);
}

#endif // CFG_UART_ONE_WIRE_SUPPORT

#if defined (__DA14531_01__)
#if (!ENABLE_SMP_SECURE)
#include "hci.h"
/**
 ****************************************************************************************
 * @brief Send dummy message to save power if legacy pairing is used in DA14531-01.
 * @param[in] msg       Pointer to message
 ****************************************************************************************
 */
void llm_p256_start_dummy_func(struct ke_msg *msg)
{
    // allocate the event message
    struct hci_rd_p256_public_key_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_LE_EVENT, 0, HCI_LE_META_EVT_CODE, hci_rd_p256_public_key_cmd_cmp_evt);

