tyh21/da14585_420/da14585_420_SES_3init/sdk/platform/arch/main/jump_table.c
    // fill event parameters
    event->subcode = HCI_LE_READ_LOCAL_P256_PUBLIC_KEY_CMP_EVT_SUBCODE;
    event->status = CO_ERROR_NO_ERROR;
    // send the message
    hci_send_2_host(event);
}
#endif // ENABLE_SMP_SECURE
#endif // __DA14531_01__

/*
 * ROM function table
 ****************************************************************************************
 */
const void * const rom_func_addr_table_var[] =
{
    (void *) rf_init_func,
    (void *) rf_reinit_func,
    (void *) uart_init_func,
    (void *) uart_flow_on_func,
    (void *) uart_flow_off_func,
    (void *) uart_finish_transfers_func,
    (void *) uart_read_func,
#if defined(CFG_UART_ONE_WIRE_SUPPORT)
    (void *) one_wire_uart_write_func,
#else
    (void *) uart_write_func,
#endif
#ifdef CFG_UART1_SDK
    (void *) UART_Handler_SDK_func,
#else
    (void *) UART_Handler_func,
#endif
    (void *) gtl_init_func,
    (void *) gtl_eif_init_func,
    (void *) gtl_eif_read_start_func,
    (void *) gtl_eif_read_hdr_func,
    (void *) gtl_eif_read_payl_func,
#if defined(CFG_UART_ONE_WIRE_SUPPORT)
    (void *) one_wire_uart_gtl_eif_tx_done_func,
#else
    (void *) gtl_eif_tx_done_func,
#endif
    (void *) gtl_eif_rx_done_func,
    (void *) h4tl_init_func,
    (void *) h4tl_read_start_func,
    (void *) h4tl_read_hdr_func,
    (void *) h4tl_read_payl_func,
    (void *) h4tl_read_next_out_of_sync_func,
    (void *) h4tl_out_of_sync_func,
#if defined(CFG_UART_ONE_WIRE_SUPPORT)
    (void *) one_wire_uart_h4tl_tx_done_func,
#else
    (void *) h4tl_tx_done_func,
#endif
    (void *) h4tl_rx_done_func,
    (void *) ke_task_init_func,
    (void *) ke_timer_init_func,
    (void *) llm_encryption_done_func,
    (void *) nvds_get_func,
    (void *) nvds_put_func,
    (void *) nvds_del_func,
    (void *) nvds_init_func,
    (void *) rwip_eif_get_func,

    (void *) platform_reset_func,
    (void *)  lld_sleep_compensate_func,
    (void *)  lld_sleep_init_func,
    (void *)  lld_sleep_us_2_lpcycles_sel_func,
    (void *)  lld_sleep_lpcycles_2_us_sel_func,

    (void *) lld_test_stop_func,
    (void *) lld_test_mode_tx_func,
#if defined (__DA14531__) && !defined (__DA14531_01__)
    (void *) JT_lld_test_mode_rx_func,  // Rx window size set to 10ms in DA14531
#else
    (void *) lld_test_mode_rx_func,
#endif
    (void *) smpc_check_param_func,
    (void *) smpc_pdu_recv_func,

    (void *) prf_init_func,
    (void *) prf_add_profile_func,
    (void *) prf_create_func,
    (void *) prf_cleanup_func,

    (void *) prf_get_id_from_task_func,
    (void *) prf_get_task_from_id_func,


    (void *) NULL, //SetSystemVars_func,
#ifdef CFG_DBG_TASK
    (void *) dbg_init_func,
    (void *) dbg_platform_reset_complete_func,
#else
    (void *) dbg_init_func_empty,
    (void *) dbg_platform_reset_complete_func_empty,
#endif
    (void *) hci_rd_local_supp_feats_cmd_handler_func,

    (void *) l2cc_pdu_pack_func,
#ifndef __DA14531_01__
    (void *) JT_l2cc_pdu_unpack_func,
#else
    (void *) l2cc_pdu_unpack_func,
#endif
    (void *) l2c_send_lecb_message_func,
    (void *) l2c_process_sdu_func,
#ifndef __DA14531_01__
    (void *) JT_l2cc_pdu_recv_ind_handler_func,
#else
    (void *) l2cc_pdu_recv_ind_handler_func,
#endif
    (void *) gapc_lecb_connect_cfm_handler_func,
    (void *) atts_l2cc_pdu_recv_handler_func,
    (void *) attc_l2cc_pdu_recv_handler_func,

    (void *) crypto_init_func,
#ifndef __DA14531_01__
    (void *) llm_le_adv_report_ind_func,
#endif
    (void *) PK_PointMult_func,
#if defined (CFG_HCI) && !defined (__DA14531__)
    (void *) JT_llm_p256_start_func,
#elif (!ENABLE_SMP_SECURE) && defined (__DA14531_01__) // save power when legacy pairing is used
    (void *) llm_p256_start_dummy_func,
#else
    (void *) llm_p256_start_func,
#endif
    (void *) llm_create_p256_key_func,
    (void *) llm_p256_req_handler_func,
#ifndef __DA14531__
    (void *) JT_llc_le_length_effective_func,
#else
    (void *) llc_le_length_effective_func,
#endif
    (void *) llc_le_length_conn_init_func,
    (void *) lld_data_tx_prog_func,
    (void *) lld_data_tx_check_func,
    (void *) llc_pdu_send_func,
    (void *) NULL, //llc_data_notif_func,
    (void *) dia_rand_func,
    (void *) dia_srand_func,
    (void *) ba431_get_rand_func,
#if !defined (__DA14531__)        // Only for DA14585, DA14586
    (void *) &modulationGainCalibration_func,
    (void *) &DCoffsetCalibration_func,
    (void *) &PllLF_IFF_MIX_CapCalibration_func,
#endif
    (void *) smpc_public_key_exchange_start_func,
    (void *) smpc_dhkey_calc_ind_func,
/*
 * DA14531-01 BLE stack behavior:
 *  The ECDH keys are always created after a pairing request, either legacy
 *  pairing or either secure connections has been selected.
 */
#if (ENABLE_SMP_SECURE) || defined (__DA14531_01__)
    (void *) smpm_ecdh_key_create_func,
#else
    (void *) smpm_ecdh_key_create_empty_func,
#endif // ENABLE_SMP_SECURE
#if defined (__DA14531__)
    (void *) ble_init_arp_func,
#endif

    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
};

// Extern variables used for accessing the SDK symbols in ROM
#if defined (__DA14531__)

#if !defined (__EXCLUDE_ROM_NVDS__)
    extern rom_nvds_cfg_t rom_nvds_cfg;
#endif

#if (USE_CHACHA20_RAND) && !defined (__EXCLUDE_ROM_CHACHA20__)
    extern const rom_chacha20_cfg_t rom_chacha20_cfg;
#endif

#if (BLE_PROFILES) && !defined (__EXCLUDE_ROM_PRF__)
#include "prf.h"
    extern const rom_prf_cfg_t rom_prf_cfg;
#endif

#if (BLE_CUSTOM1_SERVER) && !defined (__EXCLUDE_ROM_CUSTS1__)
#include "custs1.h"
    extern const rom_cust_prf_cfg_t rom_cust_prf_cfg;
#endif

#if (BLE_APP_PRESENT) && !defined (__EXCLUDE_ROM_APP_TASK__)
#include "app_entry_point.h"
    extern const rom_app_task_cfg_t rom_app_task_cfg;
#endif

#if defined (CFG_PRINTF) && !defined (__EXCLUDE_ROM_ARCH_CONSOLE__)
#include "arch_console.h"
    extern const rom_console_cfg_t rom_console_cfg;
#endif

#endif
/*
 * ROM configuration table
 ****************************************************************************************
 */
const uint32_t rom_cfg_table_var[] =
{

    (uint32_t)TASK_GTL, //TASK_APP_SEC        // 0. app task          this entry is for the security app
#if defined ( __CC_ARM )
#pragma diag_suppress 1296
#endif
    (uint32_t)&rwip_heap_non_ret[0],          // 1. rwip_heap_non_ret_pos
    (uint32_t)RWIP_HEAP_NON_RET_SIZE_JT,      // 2. rwip_heap_non_ret_size
    (uint32_t)&rwip_heap_env_ret[0],          // 3. rwip_heap_env_pos
    (uint32_t)RWIP_HEAP_ENV_SIZE_JT,          // 4. rwip_heap_env_size
    (uint32_t)&rwip_heap_db_ret[0],           // 5. rwip_heap_db_pos
    (uint32_t)RWIP_HEAP_DB_SIZE_JT,           // 6. rwip_heap_db_size
    (uint32_t)&rwip_heap_msg_ret[0],          // 7. rwip_heap_msg_pos
    (uint32_t)RWIP_HEAP_MSG_SIZE_JT,          // 8. rwip_heap_msg_size
#if defined ( __CC_ARM )
#pragma diag_warning 1296
#endif
    MAX_SLEEP_DURATION_PERIODIC_WAKEUP,     // 9. max_sleep_duration_periodic_wakeup_pos  0x320
    MAX_SLEEP_DURATION_EXTERNAL_WAKEUP,     // 10.max_sleep_duration_external_wakeup_pos  0x3e80
    #if BLE_APP_PRESENT
    TASK_APP,                               // 11. app_main_task_pos
    #else // BLE_HOST_PRESENT
    TASK_GTL,                               // 11.
    #endif
    0x00D2,                                 // 12. man_id_pos Dialog Semi ManId

    50,     //13. max_tl_pending_packets_adv_pos
    60,     //14.  max_tl_pending_packets_pos
    1,      //15. ea_timer_prog_delay_pos
    1,      //16. ea_clock_corr_lat_pos
    2,      //17. ea_be_used_dft_pos
    2,      //18. start_margin_pos
    4,      //19. test_mode_margin_pos
    3,      //20.  bw_used_slave_dft_pos
    6,      //21.  bw_used_adv_dft_pos
#ifdef XTAL_32000HZ
    1,      //22. hz32000_pos
#else
    0,      //22. hz32000_pos
#endif
    2,      //23. rwble_prog_latency_dft_pos
    2,      //24. rwble_asap_latency_pos                  24
    0,      // rwble_priority_adv_ldc_pos              25
    0,      // rwble_priority_scan_pos                 26
    3,      // rwble_priority_mconnect_pos             27
    3,      // rwble_priority_sconnect_pos             28
    5,      // rwble_priority_adv_hdc_pos              29
    5,      // rwble_priority_init_pos                 30
    6,      // rwble_priority_max_pos                  31
    10,     //gap_lecb_cnx_max
    10,     //gapm_scan_filter_size
    200,    //smpc_rep_attempts_timer_def_val
    3000,   //smpc_rep_attempts_timer_max_val
    2,      //smpc_rep_attempts_timer_mult
    3000,   //smpc_timeout_timer_duration
    0x0BB8, //att_trans_rtx
    0x10,   //att_sec_enc_key_size
    468,    //wakeup_boundary_var
#if defined (__DA14531__)
    460,    //lld_evt_abort_cnt_duration
#else
    485,    //lld_evt_abort_cnt_duration
#endif
    624,    //ea_check_halfslot_boundary
    106,    //ea_check_slot_boundary
    (BLE_RX_BUFFER_CNT/2),      //RX interrupt threshold
    BLE_CONNECTION_MAX_USER,    //nb_links_user
    LLM_ADV_INTERVAL_MIN,       //llm_adv_interval_min_noncon_disc_pos
#if defined (__DA14531__)
    10,     //sw_version_major_pos
    1,      //sw_version_minor_pos
    1250,   //adv_int_conn_dir_pos
    650,    //adv_int_nonconn_undir_pos
    1500,   //adv_int_con_dir_ldc_pos
#if (__FPGA__)
    250,
#else
#if (RADIO_ANALOG)
    272,
#else
    175,    //prefetch_time_pos
#endif
#endif
#endif
/*
 * Support for SDK symbols in ROM (only for DA14531)
 */
#if defined ( __CC_ARM )
#pragma diag_suppress 1296
#endif
#if defined (__DA14531__)
#if !defined (__EXCLUDE_ROM_NVDS__)
    (uint32_t) &rom_nvds_cfg,                // nvds_config_pos
#else
    (uint32_t) NULL,
#endif

#if (USE_CHACHA20_RAND) && !defined (__EXCLUDE_ROM_CHACHA20__)
    (uint32_t) &rom_chacha20_cfg,            // chacha_config_pos
#else
    (uint32_t) NULL,
#endif

#if (BLE_CUSTOM1_SERVER) && !defined (__EXCLUDE_ROM_CUSTS1__)
    (uint32_t) &rom_cust_prf_cfg,            // custs1_prf_conf_pos
#else
    (uint32_t) NULL,
#endif

#if (BLE_PROFILES) && !defined (__EXCLUDE_ROM_PRF__)
    (uint32_t) &rom_prf_cfg,                 // prfconf_config_pos
#else
    (uint32_t) NULL,
#endif

#if (BLE_APP_PRESENT) && !defined (__EXCLUDE_ROM_APP_TASK__)
    (uint32_t) &rom_app_task_cfg,            // appconf_config_pos
#else
    (uint32_t) NULL,
#endif

#if defined (CFG_PRINTF) && !defined (__EXCLUDE_ROM_ARCH_CONSOLE__)
    (uint32_t) &rom_console_cfg,            // console_config_pos
#else
    (uint32_t) NULL,
#endif

#endif
# if defined ( __CC_ARM )
#  pragma diag_warning 1296
# endif
};
